dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/gmac.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GMAC_ST2CW112_OFFSET                (0x764)                                       /**<  (GMAC_ST2CW112) Screening Type 2 Compare Word 1 Register (index = 12)  Offset */

#define GMAC_ST2CW112_OFFSVAL_Pos           0                                              /**< (GMAC_ST2CW112) Offset Value in Bytes Position */
#define GMAC_ST2CW112_OFFSVAL_Msk           (_U_(0x7F) << GMAC_ST2CW112_OFFSVAL_Pos)       /**< (GMAC_ST2CW112) Offset Value in Bytes Mask */
#define GMAC_ST2CW112_OFFSVAL(value)        (GMAC_ST2CW112_OFFSVAL_Msk & ((value) << GMAC_ST2CW112_OFFSVAL_Pos))
#define GMAC_ST2CW112_OFFSSTRT_Pos          7                                              /**< (GMAC_ST2CW112) Ethernet Frame Offset Start Position */
#define GMAC_ST2CW112_OFFSSTRT_Msk          (_U_(0x3) << GMAC_ST2CW112_OFFSSTRT_Pos)       /**< (GMAC_ST2CW112) Ethernet Frame Offset Start Mask */
#define GMAC_ST2CW112_OFFSSTRT(value)       (GMAC_ST2CW112_OFFSSTRT_Msk & ((value) << GMAC_ST2CW112_OFFSSTRT_Pos))
#define   GMAC_ST2CW112_OFFSSTRT_FRAMESTART_Val _U_(0x0)                                       /**< (GMAC_ST2CW112) Offset from the start of the frame  */
#define   GMAC_ST2CW112_OFFSSTRT_ETHERTYPE_Val _U_(0x1)                                       /**< (GMAC_ST2CW112) Offset from the byte after the EtherType field  */
#define   GMAC_ST2CW112_OFFSSTRT_IP_Val     _U_(0x2)                                       /**< (GMAC_ST2CW112) Offset from the byte after the IP header field  */
#define   GMAC_ST2CW112_OFFSSTRT_TCP_UDP_Val _U_(0x3)                                       /**< (GMAC_ST2CW112) Offset from the byte after the TCP/UDP header field  */
#define GMAC_ST2CW112_OFFSSTRT_FRAMESTART   (GMAC_ST2CW112_OFFSSTRT_FRAMESTART_Val << GMAC_ST2CW112_OFFSSTRT_Pos)  /**< (GMAC_ST2CW112) Offset from the start of the frame Position  */
#define GMAC_ST2CW112_OFFSSTRT_ETHERTYPE    (GMAC_ST2CW112_OFFSSTRT_ETHERTYPE_Val << GMAC_ST2CW112_OFFSSTRT_Pos)  /**< (GMAC_ST2CW112) Offset from the byte after the EtherType field Position  */
#define GMAC_ST2CW112_OFFSSTRT_IP           (GMAC_ST2CW112_OFFSSTRT_IP_Val << GMAC_ST2CW112_OFFSSTRT_Pos)  /**< (GMAC_ST2CW112) Offset from the byte after the IP header field Position  */
#define GMAC_ST2CW112_OFFSSTRT_TCP_UDP      (GMAC_ST2CW112_OFFSSTRT_TCP_UDP_Val << GMAC_ST2CW112_OFFSSTRT_Pos)  /**< (GMAC_ST2CW112) Offset from the byte after the TCP/UDP header field Position  */
#define GMAC_ST2CW112_MASK                  _U_(0x1FF)                                     /**< \deprecated (GMAC_ST2CW112) Register MASK  (Use GMAC_ST2CW112_Msk instead)  */
#define GMAC_ST2CW112_Msk                   _U_(0x1FF)                                     /**< (GMAC_ST2CW112) Register Mask  */


/* -------- GMAC_ST2CW013 : (GMAC Offset: 0x768) (R/W 32) Screening Type 2 Compare Word 0 Register (index = 13) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MASKVAL:16;                /**< bit:  0..15  Mask Value                               */
    uint32_t COMPVAL:16;                /**< bit: 16..31  Compare Value                            */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_ST2CW013_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GMAC_ST2CW013_OFFSET                (0x768)                                       /**<  (GMAC_ST2CW013) Screening Type 2 Compare Word 0 Register (index = 13)  Offset */

#define GMAC_ST2CW013_MASKVAL_Pos           0                                              /**< (GMAC_ST2CW013) Mask Value Position */
#define GMAC_ST2CW013_MASKVAL_Msk           (_U_(0xFFFF) << GMAC_ST2CW013_MASKVAL_Pos)     /**< (GMAC_ST2CW013) Mask Value Mask */
#define GMAC_ST2CW013_MASKVAL(value)        (GMAC_ST2CW013_MASKVAL_Msk & ((value) << GMAC_ST2CW013_MASKVAL_Pos))
#define GMAC_ST2CW013_COMPVAL_Pos           16                                             /**< (GMAC_ST2CW013) Compare Value Position */
#define GMAC_ST2CW013_COMPVAL_Msk           (_U_(0xFFFF) << GMAC_ST2CW013_COMPVAL_Pos)     /**< (GMAC_ST2CW013) Compare Value Mask */
#define GMAC_ST2CW013_COMPVAL(value)        (GMAC_ST2CW013_COMPVAL_Msk & ((value) << GMAC_ST2CW013_COMPVAL_Pos))
#define GMAC_ST2CW013_Msk                   _U_(0xFFFFFFFF)                                /**< (GMAC_ST2CW013) Register Mask  */


/* -------- GMAC_ST2CW113 : (GMAC Offset: 0x76c) (R/W 32) Screening Type 2 Compare Word 1 Register (index = 13) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t OFFSVAL:7;                 /**< bit:   0..6  Offset Value in Bytes                    */
    uint32_t OFFSSTRT:2;                /**< bit:   7..8  Ethernet Frame Offset Start              */
    uint32_t :23;                       /**< bit:  9..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_ST2CW113_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GMAC_ST2CW113_OFFSET                (0x76C)                                       /**<  (GMAC_ST2CW113) Screening Type 2 Compare Word 1 Register (index = 13)  Offset */

#define GMAC_ST2CW113_OFFSVAL_Pos           0                                              /**< (GMAC_ST2CW113) Offset Value in Bytes Position */
#define GMAC_ST2CW113_OFFSVAL_Msk           (_U_(0x7F) << GMAC_ST2CW113_OFFSVAL_Pos)       /**< (GMAC_ST2CW113) Offset Value in Bytes Mask */
#define GMAC_ST2CW113_OFFSVAL(value)        (GMAC_ST2CW113_OFFSVAL_Msk & ((value) << GMAC_ST2CW113_OFFSVAL_Pos))
#define GMAC_ST2CW113_OFFSSTRT_Pos          7                                              /**< (GMAC_ST2CW113) Ethernet Frame Offset Start Position */
#define GMAC_ST2CW113_OFFSSTRT_Msk          (_U_(0x3) << GMAC_ST2CW113_OFFSSTRT_Pos)       /**< (GMAC_ST2CW113) Ethernet Frame Offset Start Mask */
#define GMAC_ST2CW113_OFFSSTRT(value)       (GMAC_ST2CW113_OFFSSTRT_Msk & ((value) << GMAC_ST2CW113_OFFSSTRT_Pos))
#define   GMAC_ST2CW113_OFFSSTRT_FRAMESTART_Val _U_(0x0)                                       /**< (GMAC_ST2CW113) Offset from the start of the frame  */
#define   GMAC_ST2CW113_OFFSSTRT_ETHERTYPE_Val _U_(0x1)                                       /**< (GMAC_ST2CW113) Offset from the byte after the EtherType field  */
#define   GMAC_ST2CW113_OFFSSTRT_IP_Val     _U_(0x2)                                       /**< (GMAC_ST2CW113) Offset from the byte after the IP header field  */
#define   GMAC_ST2CW113_OFFSSTRT_TCP_UDP_Val _U_(0x3)                                       /**< (GMAC_ST2CW113) Offset from the byte after the TCP/UDP header field  */
#define GMAC_ST2CW113_OFFSSTRT_FRAMESTART   (GMAC_ST2CW113_OFFSSTRT_FRAMESTART_Val << GMAC_ST2CW113_OFFSSTRT_Pos)  /**< (GMAC_ST2CW113) Offset from the start of the frame Position  */
#define GMAC_ST2CW113_OFFSSTRT_ETHERTYPE    (GMAC_ST2CW113_OFFSSTRT_ETHERTYPE_Val << GMAC_ST2CW113_OFFSSTRT_Pos)  /**< (GMAC_ST2CW113) Offset from the byte after the EtherType field Position  */
#define GMAC_ST2CW113_OFFSSTRT_IP           (GMAC_ST2CW113_OFFSSTRT_IP_Val << GMAC_ST2CW113_OFFSSTRT_Pos)  /**< (GMAC_ST2CW113) Offset from the byte after the IP header field Position  */
#define GMAC_ST2CW113_OFFSSTRT_TCP_UDP      (GMAC_ST2CW113_OFFSSTRT_TCP_UDP_Val << GMAC_ST2CW113_OFFSSTRT_Pos)  /**< (GMAC_ST2CW113) Offset from the byte after the TCP/UDP header field Position  */
#define GMAC_ST2CW113_MASK                  _U_(0x1FF)                                     /**< \deprecated (GMAC_ST2CW113) Register MASK  (Use GMAC_ST2CW113_Msk instead)  */
#define GMAC_ST2CW113_Msk                   _U_(0x1FF)                                     /**< (GMAC_ST2CW113) Register Mask  */


